[
  {
    "id": 1,
    "title": "Sea Life",
    "category": "Poetry",
    "tags": ["nature", "ocean", "body", "surreal"],
    "date": "2026-01-15",
    "submittedTo": "Foyle Young Poets",
    "subtitle": null,
    "authorCredit": null,
    "body": "Sweltering sunlight burns my eyelids \nPopping my green orbs open as smoke clouds my vision\nCurtains crawled, bunched on the floor with \nnecklaces tied so tightly around \nmy neck that I suffocate on my white pillow cases as I roll around\nmy dice and watch as they\nM\nE\nL\nT\nagainst the heat of the sun I watch the light—\nseep in through my blinds and cascade over my \nburnished amber hued silhouette\nI smell deep inside the ocean blue sea and look \nout past the beach, sand curdled up around my toes\nRocks and seashells digging in so tightly as \nSlimed seaweed strangles my angles\nHolding me down into place as the sun\nburns Swiss holes into my skin\ncrabs knead their way into my deep blue veins filled with kraken ink\nI watch as time moves backwards\nUntil I reach the green eyed little girl \nShe throws toys into the sea and blinds\ncurtains float across the water, blocking the great whites\nSuffocating them, draining them of color\nI can feel rays welting my skin\nLife as plants intersect themselves into my eyes sockets\nand fish swim in my hair nest\nGrowing faster and faster against the burning fiery tendrils\nof the melting sweltering sun\nI look up to see eagles soaring around the deep blue sky\nPreying on the weak animals buried deep into my flesh\nMy veins coarse through my plant body as I ground myself into the earth sand\nIn every crevice\nPlants in my mouth, suffocating and strangling my tongue as it fights against the surface of the deep blue water. \n\nI never want this day day day to end until the \nplants die\nthe seaweed falls off\nAnd the crabs crawl out of my bronze body while the sun burns \nit like an oven \nI never want this day to end \neven when the clock's arm tick tick ticks faster\nAnd that same green eyed girl kicks against the surface, \nkilling my crabs,\nSlicing my plants off my \nlifeless \nvineless \ncolorless \nbody as I drown in the water.\nThe sun is baking me and I want to cry. I want to scream.\nuntil my tears flow into the water and it parts into its own river, whisking away my \nplants\ncrabs\nand seaweed \nas it cascades down my back over and into the \ndeep devouring blue sea.",
    "excerpt": "Sweltering sunlight burns my eyelids. Popping my green orbs open as smoke clouds my vision. Curtains crawled, bunched on the floor with necklaces tied so tightly around my neck..."
  },
  {
    "id": 2,
    "title": "Tonight I Can Write",
    "category": "Poetry",
    "tags": ["memory", "loss", "family"],
    "date": "2026-01-20",
    "submittedTo": null,
    "subtitle": "after Pablo Neruda",
    "authorCredit": null,
    "body": "I do not miss the nights of vanish,\nWhen we would laugh until our stomachs sloshed and spun and tumbled onto the floor\n\nI do not miss the anguish scribbled on my mother's face with sloppy pens as the front door turned\nI do not miss the tarnish of our bond, rope hairs snapping\nNor do I miss the broken clock tick deep from my fathers throat\n\nI do not miss the nights of vanish,\nWhen I suffocated from the love eloping me,\nCradling carrying me into my room, tucking me in.\n\nHow can I miss the nights of vanish?\nWhere he kissed my cheek and looped our bonds again,\nSecuring the square knot\n\nI cannot miss the nights of vanish,\nWhen the sun spun no stilling in sight\nWhen vanish meant disappearing not a trick.\n\nUs holding hands 8 kilometers apart\n\nVanish, anguish, and tarnish all from those nights\n\nBut most of all, I miss the nights of vanish\n\nWhen he soared high into the sky\nUp into the endless seas of chances\n\nDipping down into the shallow water and spraying me as I watched in \nAwe",
    "excerpt": "I do not miss the nights of vanish, when we would laugh until our stomachs sloshed and spun and tumbled onto the floor..."
  },
  {
    "id": 3,
    "title": "John Doe",
    "category": "Poetry",
    "tags": ["dreams", "identity", "stranger"],
    "date": "2026-02-01",
    "submittedTo": null,
    "subtitle": null,
    "authorCredit": null,
    "body": "I've seen him in my dreams \nAnd nightmares holding a flashlight onto my thoughts\nBefore His clothes faded out into the background of my room\nI've seen him on the street holding a sign with black marker\nLaying out on the floor with a beanie\nI've seen him when he handed me my hot chocolate\nThe scorching cup that made me hiss not fazing him\nI've seen him open the heavy glass door for me and my mom\nTelling me to have a good day,\nWhen he would entire my mind that night\nIronic, right?\nI've seen him outside, in a store, holding a door\nIn my dreams blinding my eyes\nBut I still don't know who this man is.\nDo you?",
    "excerpt": "I've seen him in my dreams and nightmares holding a flashlight onto my thoughts. Before His clothes faded out into the background of my room..."
  },
  {
    "id": 4,
    "title": "Anselm Kiefer: The Renowned Orders of the Night",
    "category": "Poetry",
    "tags": ["art", "ekphrasis", "night", "stars"],
    "date": "2026-02-05",
    "submittedTo": null,
    "subtitle": null,
    "authorCredit": null,
    "body": "Stars flooding the sky\nLike heat flames centered in the earth\nWith cracks on the floor, dry dry dry\nBoy in the middle, lying down up\nAnd against the stars\nGiven up\n\nThey are flooding him, he is their prisoner\nTaken from his bed in the middle of the night\nAnd sacrificed onto dry stones\nAnd bright lights\nLying down against the\nStunning, blinding lights\n\nHe can't move, can't sweat, can't breathe\nHow could he? \nWhen the stars are in his throat,\nAnd light is seeping from out his chest into the air\n\nExploding around him in whooshes \n\nHe utterly belongs to the night\nDead in its wake\nRising in its light\nBut he still can't move?\nHow could he?\nWhen he's bare and so vulnerable\nSo fragile against the all mighty night\nAnd when the wind brushes the stars to the side\nAnd sunlight rises in their wake\nHe will get up and leave,\n\nWait for the next night\nTo give himself up for the\nBright stars.",
    "excerpt": "Stars flooding the sky like heat flames centered in the earth. With cracks on the floor, dry dry dry. Boy in the middle, lying down up and against the stars..."
  },
  {
    "id": 5,
    "title": "4 White Horse Men",
    "category": "Poetry",
    "tags": ["surreal", "dark", "animals"],
    "date": "2026-02-10",
    "submittedTo": null,
    "subtitle": null,
    "authorCredit": null,
    "body": "4 white horse men\nprancing in a dark room necks out long\nhanging loosely by their dragging feet\ntongues lolling licking lips\n\neyes in walls\neyes etched into the surface\neyes' gaze following the horses \ntrotting about the room\nlips sore now\neyes like diamonds\n\nleft right left right\nsoft delicate hands evil man\nforgiving water tempting power\n\nhorses? they're sheep\neyes covered hands hooves jutted out tails wagging\n\nsoftly singing lullaby noises humming happy tunes\nwalking into invisible water\n\ndying of thirst",
    "excerpt": "4 white horse men prancing in a dark room necks out long, hanging loosely by their dragging feet, tongues lolling licking lips..."
  },
  {
    "id": 6,
    "title": "Dying of Thirst",
    "category": "Poetry",
    "tags": ["fire", "shame", "villanelle"],
    "date": "2026-02-15",
    "submittedTo": null,
    "subtitle": null,
    "authorCredit": null,
    "body": "Blazing heat twirling a ballet\nCurling at the ends like wisps of hair kissed by moonlight \nDown into the ashes\n\nFire licking my fingers\nEating my tongue\nHissing and spitting \nDown into the ashes\n\nI've been here before\nCarrying shame on my back\nHunched over, my shadow\nDown into the ashes\n\nBlazing heat twirling a ballet\nDown into the ashes",
    "excerpt": "Blazing heat twirling a ballet. Curling at the ends like wisps of hair kissed by moonlight. Down into the ashes..."
  },
  {
    "id": 7,
    "title": "The Invisible Weight",
    "category": "Opinion",
    "tags": ["mental health", "society", "vulnerability"],
    "date": "2026-01-28",
    "submittedTo": null,
    "subtitle": "On what we carry but never say",
    "authorCredit": null,
    "body": "There is a particular kind of exhaustion that has no name in most languages. It is not the tiredness of a long day or the ache of physical labor. It is the weight of performing wellness — of waking up, composing your face into something presentable, and going about your life while something inside you quietly screams.\n\nWe talk about mental health more than we ever have. The conversations are louder, the Instagram graphics more plentiful, the therapy memes more shareable. And yet, in the actual moments when it matters — in offices, at dinner tables, in the middle of ordinary Tuesdays — we still mostly pretend. We say \"I'm fine\" with the automaticity of a reflex, not because we are fine, but because we have learned that \"fine\" is what the world wants to receive.\n\nThis is not a failure of awareness. It is a failure of permission.\n\nWe have built a culture that celebrates vulnerability in the abstract and punishes it in the specific. Saying \"I struggled with anxiety in college\" is now almost a résumé line, a sign of depth and resilience. But saying \"I am struggling right now, today, in this meeting\" — that remains a kind of social suicide. The past is safe. The present is not.\n\nWhat would change if we extended the same grace to the present tense? If we let people say \"I am not okay\" without it becoming a crisis requiring management, a confession requiring reassurance, a burden requiring immediate resolution? Perhaps nothing dramatic. Perhaps just — less pretending. Less of that specific, corrosive loneliness that comes not from being alone, but from being surrounded by people and still entirely unseen.",
    "excerpt": "There is a particular kind of exhaustion that has no name in most languages. It is not the tiredness of a long day or the ache of physical labor. It is the weight of performing wellness..."
  },
  {
    "id": 8,
    "title": "On Growing Up Online",
    "category": "Opinion",
    "tags": ["technology", "identity", "gen z"],
    "date": "2026-02-03",
    "submittedTo": null,
    "subtitle": "A generation that has never known otherwise",
    "authorCredit": null,
    "body": "My earliest memory of the internet is not a memory of technology. It is a memory of desire — the particular wanting that came from seeing other people's lives rendered in bright, curated squares, and feeling, for the first time, the specific ache of comparison.\n\nI was eleven. The platform was Instagram. The feeling has never entirely left.\n\nThere is a tendency, in discussions about young people and social media, to frame the issue as one of screen time — as if the problem were simply quantitative, a matter of hours logged, and the solution were simply to log fewer. This misses the point almost entirely. The question is not how much time we spend online. It is what that time does to our sense of what is normal, what is possible, and what we owe ourselves.\n\nWhen you grow up with a curated window into thousands of other lives, you absorb, without quite meaning to, a baseline of what life should look like. You learn that certain rooms, certain bodies, certain friendships, certain milestones belong to a category called \"the good life,\" and you measure your own experience against that category constantly, reflexively, often without realizing you are doing it.\n\nThis is not new. Comparison is ancient. But scale is not neutral. There is a difference between measuring yourself against your neighborhood and measuring yourself against an algorithmically optimized feed of the most aesthetically successful moments of ten thousand strangers.\n\nI am not arguing that growing up online is only damage. There is real community here, real discovery, real connection across distances that would otherwise have been insurmountable. The internet gave me writers I love, ideas that changed how I think, people who understood specific and obscure parts of me before I understood them myself.\n\nBut I think honesty requires acknowledging the cost alongside the gift. We are the first generation to have grown up inside a mirror that never stops reflecting, that reflects not just what we are but what we could be, should be, aren't yet. Living inside that mirror takes something from you. I'm still figuring out what.",
    "excerpt": "My earliest memory of the internet is not a memory of technology. It is a memory of desire — the particular wanting that came from seeing other people's lives rendered in bright, curated squares..."
  },
  {
    "id": 9,
    "title": "What Silence Taught Me",
    "category": "Opinion",
    "tags": ["introspection", "quiet", "growth"],
    "date": "2026-02-18",
    "submittedTo": null,
    "subtitle": null,
    "authorCredit": null,
    "body": "I spent a long time being afraid of quiet. Not silence in the acoustic sense — I could sit in a silent room — but the inner quiet that comes when you stop filling your head with noise. Music between classes, podcasts on walks, videos before sleep. The content itself hardly mattered. What mattered was that it was there, a reliable buffer between me and whatever was waiting in the space underneath.\n\nI don't know exactly when I started to suspect that the buffer was part of the problem. It happened gradually, the way most realizations do — not as a single moment but as a slow accumulation of evidence that the thing I was avoiding was not actually dangerous, just uncomfortable. And that uncomfortable things, sat with long enough, sometimes become something else.\n\nThe first time I walked somewhere without headphones on purpose, I felt almost rude. Like I was refusing an offering the world had made. But I also noticed things I'd stopped noticing: the specific quality of afternoon light in October, the rhythm of my own footsteps, the way my mind, left to itself, meandered toward things I'd been too distracted to think through.\n\nSilence, I learned, is not emptiness. It is a different kind of fullness. It is where unfinished thoughts go to become finished, where feelings that have been circling at altitude finally find somewhere to land. It is also, I suspect, where much of what I would eventually want to write came from — not from inspiration arriving out of nowhere, but from having finally made enough space to hear it.",
    "excerpt": "I spent a long time being afraid of quiet. Not silence in the acoustic sense — I could sit in a silent room — but the inner quiet that comes when you stop filling your head with noise..."
  },
  {
    "id": 10,
    "title": "The City as a Living Thing",
    "category": "Essays",
    "tags": ["urban", "observation", "place"],
    "date": "2026-01-10",
    "submittedTo": null,
    "subtitle": "Notes on paying attention",
    "authorCredit": null,
    "body": "A city is easiest to see when you are new to it. The first weeks in an unfamiliar place have a particular quality of attention — everything is legible as data, as clue, as evidence of how people here have chosen to arrange their lives. The way a neighborhood smells at six in the morning. The specific angle of afternoon shadow on a particular street. The demographic composition of a bus at different hours. You notice all of this, compulsively and almost despite yourself, because you are trying to understand where you are.\n\nThen familiarity sets in. The city becomes background — a stage set rather than a subject — and you stop really seeing it. You know the routes so well that your body can navigate them while your mind is elsewhere, which is a remarkable cognitive achievement and also a kind of loss.\n\nThe writers I admire most are the ones who never fully let familiarity win. Who retain, or periodically recover, the foreigner's eye even in their own neighborhoods. Teju Cole writing Lagos and New York. Joan Didion writing Los Angeles as a place that actively resists meaning. Geoff Dyer writing everywhere as though the act of paying careful attention were itself a moral position.\n\nI am still learning how to look. I find it helps to slow down — to choose one block and walk it more carefully than you walked it yesterday, to sit somewhere you usually pass through and stay long enough for the ordinary choreography of the place to become visible. The man who opens the same window at the same time every morning. The specific way strangers negotiate a narrow sidewalk. The cumulative texture of a place lived in, over time, by many people who did not know each other.\n\nNone of this is dramatic. But attention, I think, is where everything interesting begins — in writing and in the rest of life too.",
    "excerpt": "A city is easiest to see when you are new to it. The first weeks in an unfamiliar place have a particular quality of attention — everything is legible as data, as clue, as evidence of how people here have chosen to arrange their lives..."
  },
  {
    "id": 11,
    "title": "On the Uses of Boredom",
    "category": "Essays",
    "tags": ["creativity", "stillness", "modern life"],
    "date": "2026-01-22",
    "submittedTo": null,
    "subtitle": null,
    "authorCredit": null,
    "body": "Boredom has become a contraband experience. We have collectively, and largely without deciding to, arranged our lives so that genuine boredom — the kind that lasts more than thirty seconds before a phone appears — has become nearly impossible to achieve. This is presented, mostly, as progress. Waiting rooms have screens. Elevators have screens. The thirty-second gap between one thing and the next now has a podcast.\n\nI want to make a case for boredom. Not as a romantic preference for discomfort, or as nostalgia for a simpler time, but as a genuinely useful cognitive state that we have engineered out of our lives at some cost.\n\nThe research on this is, by now, fairly robust: boredom activates the default mode network, the brain's \"resting state,\" which is associated with creativity, future planning, consolidating memory, and the kind of associative thinking that generates novel connections. When you are bored, your mind wanders. When your mind wanders, it goes places it would not have gone if you had been directing it.\n\nThis is where a lot of things that matter come from. The shower thought that solves the problem you'd been stuck on. The memory that rises unprompted and turns out to be load-bearing. The question that arrives from nowhere: what do I actually want?\n\nI am not arguing for the abolition of entertainment, or for the virtues of staring at walls. I am arguing for the deliberate preservation of unscheduled time — of gaps that are allowed to remain gaps, rather than being immediately filled. The willingness to be, for a moment, bored: not as failure of resourcefulness, but as a small act of trust in your own mind.",
    "excerpt": "Boredom has become a contraband experience. We have collectively, and largely without deciding to, arranged our lives so that genuine boredom — the kind that lasts more than thirty seconds before a phone appears — has become nearly impossible to achieve..."
  },
  {
    "id": 12,
    "title": "What We Talk About When We Talk About Home",
    "category": "Essays",
    "tags": ["belonging", "memory", "place"],
    "date": "2026-02-20",
    "submittedTo": null,
    "subtitle": null,
    "authorCredit": null,
    "body": "Home is one of those words that seems simple until you try to use it precisely. Where are you from? people ask, and most of us have a practiced answer — a city, a country, a place — that we give on autopilot without stopping to consider whether it is actually true.\n\nI have been thinking about this because I am at an age when the question is becoming more complicated. The home I grew up in is no longer a home in the sense of a place I return to. The city I'm in now is familiar but not yet instinctive. The places I have loved most have not always been places I was from.\n\nMaybe home is not primarily a place at all. There are people for whom it clearly is — who carry a particular landscape inside them the way others carry a language, who feel most like themselves when they are near a specific body of water or in a specific quality of light. I envy them their certainty. But I suspect they are not the majority.\n\nFor most of us, I think, home is a feeling that attaches to places rather than residing in them. It is the particular quality of being known — by people, by routines, by a landscape that has become personal through repetition. You can build it anywhere, though it takes time, and the building is not something you can rush or engineer. It happens gradually, in the accumulation of small recognitions: the barista who remembers your order, the route you've walked enough times that your feet know it, the light in a particular room at a particular time of day that has, without your quite noticing, started to feel like yours.\n\nI don't know yet where home is for me. But I'm starting to think that's less a problem to be solved than a question to stay curious about.",
    "excerpt": "Home is one of those words that seems simple until you try to use it precisely. Where are you from? people ask, and most of us have a practiced answer — a city, a country, a place..."
  }
]
