[
  {
    "id": 1,
    "title": "Sea Life",
    "category": "Poetry",
    "tags": ["nature", "ocean", "body", "surreal"],
    "date": "2026-01-15",
    "submittedTo": "Foyle Young Poets",
    "subtitle": null,
    "authorCredit": null,
    "body": "Sweltering sunlight burns my eyelids \nPopping my green orbs open as smoke clouds my vision\nCurtains crawled, bunched on the floor with \nnecklaces tied so tightly around \nmy neck that I suffocate on my white pillow cases as I roll around\nmy dice and watch as they\nM\nE\nL\nT\nagainst the heat of the sun I watch the light—\nseep in through my blinds and cascade over my \nburnished amber hued silhouette\nI smell deep inside the ocean blue sea and look \nout past the beach, sand curdled up around my toes\nRocks and seashells digging in so tightly as \nSlimed seaweed strangles my angles\nHolding me down into place as the sun\nburns Swiss holes into my skin\ncrabs knead their way into my deep blue veins filled with kraken ink\nI watch as time moves backwards\nUntil I reach the green eyed little girl \nShe throws toys into the sea and blinds\ncurtains float across the water, blocking the great whites\nSuffocating them, draining them of color\nI can feel rays welting my skin\nLife as plants intersect themselves into my eyes sockets\nand fish swim in my hair nest\nGrowing faster and faster against the burning fiery tendrils\nof the melting sweltering sun\nI look up to see eagles soaring around the deep blue sky\nPreying on the weak animals buried deep into my flesh\nMy veins coarse through my plant body as I ground myself into the earth sand\nIn every crevice\nPlants in my mouth, suffocating and strangling my tongue as it fights against the surface of the deep blue water. \n\nI never want this day day day to end until the \nplants die\nthe seaweed falls off\nAnd the crabs crawl out of my bronze body while the sun burns \nit like an oven \nI never want this day to end \neven when the clock's arm tick tick ticks faster\nAnd that same green eyed girl kicks against the surface, \nkilling my crabs,\nSlicing my plants off my \nlifeless \nvineless \ncolorless \nbody as I drown in the water.\nThe sun is baking me and I want to cry. I want to scream.\nuntil my tears flow into the water and it parts into its own river, whisking away my \nplants\ncrabs\nand seaweed \nas it cascades down my back over and into the \ndeep devouring blue sea.",
    "excerpt": "Sweltering sunlight burns my eyelids. Popping my green orbs open as smoke clouds my vision. Curtains crawled, bunched on the floor with necklaces tied so tightly around my neck..."
  },
  {
    "id": 2,
    "title": "Tonight I Can Write",
    "category": "Poetry",
    "tags": ["memory", "loss", "family"],
    "date": "2026-01-20",
    "submittedTo": null,
    "subtitle": "after Pablo Neruda",
    "authorCredit": null,
    "body": "I do not miss the nights of vanish,\nWhen we would laugh until our stomachs sloshed and spun and tumbled onto the floor\n\nI do not miss the anguish scribbled on my mother's face with sloppy pens as the front door turned\nI do not miss the tarnish of our bond, rope hairs snapping\nNor do I miss the broken clock tick deep from my fathers throat\n\nI do not miss the nights of vanish,\nWhen I suffocated from the love eloping me,\nCradling carrying me into my room, tucking me in.\n\nHow can I miss the nights of vanish?\nWhere he kissed my cheek and looped our bonds again,\nSecuring the square knot\n\nI cannot miss the nights of vanish,\nWhen the sun spun no stilling in sight\nWhen vanish meant disappearing not a trick.\n\nUs holding hands 8 kilometers apart\n\nVanish, anguish, and tarnish all from those nights\n\nBut most of all, I miss the nights of vanish\n\nWhen he soared high into the sky\nUp into the endless seas of chances\n\nDipping down into the shallow water and spraying me as I watched in \nAwe",
    "excerpt": "I do not miss the nights of vanish, when we would laugh until our stomachs sloshed and spun and tumbled onto the floor..."
  },
  {
    "id": 3,
    "title": "John Doe",
    "category": "Poetry",
    "tags": ["dreams", "identity", "stranger"],
    "date": "2026-02-01",
    "submittedTo": null,
    "subtitle": null,
    "authorCredit": null,
    "body": "I've seen him in my dreams \nAnd nightmares holding a flashlight onto my thoughts\nBefore His clothes faded out into the background of my room\nI've seen him on the street holding a sign with black marker\nLaying out on the floor with a beanie\nI've seen him when he handed me my hot chocolate\nThe scorching cup that made me hiss not fazing him\nI've seen him open the heavy glass door for me and my mom\nTelling me to have a good day,\nWhen he would entire my mind that night\nIronic, right?\nI've seen him outside, in a store, holding a door\nIn my dreams blinding my eyes\nBut I still don't know who this man is.\nDo you?",
    "excerpt": "I've seen him in my dreams and nightmares holding a flashlight onto my thoughts. Before His clothes faded out into the background of my room..."
  },
  {
    "id": 4,
    "title": "Anselm Kiefer: The Renowned Orders of the Night",
    "category": "Poetry",
    "tags": ["art", "ekphrasis", "night", "stars"],
    "date": "2026-02-05",
    "submittedTo": null,
    "subtitle": null,
    "authorCredit": null,
    "body": "Stars flooding the sky\nLike heat flames centered in the earth\nWith cracks on the floor, dry dry dry\nBoy in the middle, lying down up\nAnd against the stars\nGiven up\n\nThey are flooding him, he is their prisoner\nTaken from his bed in the middle of the night\nAnd sacrificed onto dry stones\nAnd bright lights\nLying down against the\nStunning, blinding lights\n\nHe can't move, can't sweat, can't breathe\nHow could he? \nWhen the stars are in his throat,\nAnd light is seeping from out his chest into the air\n\nExploding around him in whooshes \n\nHe utterly belongs to the night\nDead in its wake\nRising in its light\nBut he still can't move?\nHow could he?\nWhen he's bare and so vulnerable\nSo fragile against the all mighty night\nAnd when the wind brushes the stars to the side\nAnd sunlight rises in their wake\nHe will get up and leave,\n\nWait for the next night\nTo give himself up for the\nBright stars.",
    "excerpt": "Stars flooding the sky like heat flames centered in the earth. With cracks on the floor, dry dry dry. Boy in the middle, lying down up and against the stars..."
  },
  {
    "id": 5,
    "title": "4 White Horse Men",
    "category": "Poetry",
    "tags": ["surreal", "dark", "animals"],
    "date": "2026-02-10",
    "submittedTo": null,
    "subtitle": null,
    "authorCredit": null,
    "body": "4 white horse men\nprancing in a dark room necks out long\nhanging loosely by their dragging feet\ntongues lolling licking lips\n\neyes in walls\neyes etched into the surface\neyes' gaze following the horses \ntrotting about the room\nlips sore now\neyes like diamonds\n\nleft right left right\nsoft delicate hands evil man\nforgiving water tempting power\n\nhorses? they're sheep\neyes covered hands hooves jutted out tails wagging\n\nsoftly singing lullaby noises humming happy tunes\nwalking into invisible water\n\ndying of thirst",
    "excerpt": "4 white horse men prancing in a dark room necks out long, hanging loosely by their dragging feet, tongues lolling licking lips..."
  },
  {
    "id": 6,
    "title": "Dying of Thirst",
    "category": "Poetry",
    "tags": ["fire", "shame", "villanelle"],
    "date": "2026-02-15",
    "submittedTo": null,
    "subtitle": null,
    "authorCredit": null,
    "body": "Blazing heat twirling a ballet\nCurling at the ends like wisps of hair kissed by moonlight \nDowncast eyes keeping me away \n\nFlickering inwards hugging itself in a golden embrace \nOn toes that tremble with cracks of might \nBlazing heat twirling a ballet \n\nCrumplets of ash fanning across cheeks\nPirouettes of fire dancing to the melody of the night \nDowncast eyes keeping me away \n\nA pulse that flares red then fades to gray\nShame biting in cold sort of way\nBlazing heat twirling a ballet \n\nSmoke floats on the verge of dismay\nCrying loud against the sway of inferno\nDowncast eyes keeping me away \n\nVanishing before the flames can stay\nSparks retreat in a haunting pyre\nBlazing heat twirling a ballet\nDowncast eyes keeping me away ",
    "excerpt": "Blazing heat twirling a ballet. Curling at the ends like wisps of hair kissed by moonlight. Downcast eyes keeping me away..."
  },
  {
    "id": 7,
    "title": "The Only Subject We're Proud to Be Bad At",
    "category": "Opinion",
    "tags": ["education", "mathematics", "gender", "STEM"],
    "date": "2026-02-20",
    "submittedTo": null,
    "subtitle": null,
    "authorCredit": "By Isabella Zapparoli",
    "body": "The most effective form of disempowerment isn't censorship, but confusion. \n\n\"I'm not a math person.\" \"Math isn't for me.\" These statements sound harmless, though they mean something profound: society has mistaken ignorance for identity. Behind these phrases lies a system that has taught us to fear being wrong, to associate numbers with humiliation, and to believe that math belongs to certain types of people. These statements are almost said with pride, but no one would ever boast, \"I can't read.\" Illiteracy in words would be catastrophic for a student, but illiteracy in numbers is seen as a whimsical personality trait.\n\nIf math isn't for you, then who is it for? The chosen elites? The mythical \"geniuses\" who are born calculating the digits of π? This is the narrative of our society: that math belongs to the gifted, not the ordinary. But myths like these have grave consequences. They make us smaller than we are. And this myth has facilitated the creation of a world of people fluent in opinions but illiterate in numbers, a world that fears being wrong more than ignorance. \n\nThe real problem isn't the subject itself; it's how we've been taught to fear failure. School and academic institutions have turned mathematics into a performance scale, not a progress of learning. Students have become accustomed to not raising their hands, dreading going to math class, and fearing the embarrassment of not being able to solve a math problem. The result of this is a generation that would rather abandon the subject altogether than risk failure.\n\nThis fear has manifested itself miles beyond the classroom. In an age of algorithms, data, and misinformation, people who believe \"math isn't for them\" are easier to manipulate. Statistics and graphs become forms of sorcery we nod at as proof of our intelligence, even when we don't understand them. Numbers can be twisted without any resistance because most people don't have enough confidence to question or learn them. \n\nMath illiteracy isn't just a private weakness anymore; it has transformed into civic vulnerability. \n\nPart of the blame lies in how we mythologize the subject, as if it's strictly the domain of prodigies who are born with an ability to see mathematical patterns. We romanticize the geniuses who stand in the front of the classroom writing on the blackboard. We romanticize the mysterious and complex, intricate systems that are just incomprehensible symbols to us. Math is no more than music or languages; it is built through repetition and patience. You don't need to be born a prodigy, you just need to be willing to try, fail, and try again. \n\nMath, at its heart, is a language. It is the relationship between the very fundamental principles of which our world stands on: space, motion, growth, decay, and chance. It's the language our societies, world, and universe speaks. The tragedy is that we treat it as a test of intelligence rather than a form of expression. We tell children and students that \"they don't have the brain for it\", as though neurons come pre-sorted into artists, authors, and accountants. We watch as they grow up to fear the language that describes the structure and workings of their reality. \n\nThis is most common amongst women, specifically young girls. In fact, according to Stem Women (2024), \"the percentage of female graduates with core STEM degrees is steadily growing, however, the split is still just 27%.\" This unbalanced division between females and males in STEM is particularly troubling and stems from the myth that math is elite and masculine, which is a belief that has been integrated into society for generations, both subtly and explicitly. Girls learn from an early age that math rewards perfection instead of persistence and resilience and will. So many women abandon it because they've been taught that the discomfort of confusion is a sign of unintelligence. It is not. It is the pathway to understanding. \n\nIf you still believe math isn't for you, ask yourself again: who is it for then? For those who will build the algorithms that decide what you see and buy? For those who analyze the data between every click of your mouse when browsing online? For those who make policies and model the world in numbers while you avert your eyes? \n\nThe language of numbers already shapes your life, whether you speak it or not. The choice is whether you will let others translate it for you, or if you will pick up a dictionary and learn. We don't need more math geniuses or prodigies. We need citizens who aren't afraid of numbers; students who recognize the beauty in logic; people who can meet the mathematician with the same curiosity they give to the painter. \n\nMath is the only subject we are proud to be bad at, and it's time we stopped treating mathematical ignorance as a cute quirk of personality. ",
    "excerpt": "The most effective form of disempowerment isn't censorship, but confusion. \"I'm not a math person.\" \"Math isn't for me.\" These statements sound harmless, though they mean something profound..."
  },
  {
    "id": 8,
    "title": "Convicted",
    "category": "Prose",
    "tags": ["sci-fi", "courtroom", "identity", "space"],
    "date": "2026-02-22",
    "submittedTo": null,
    "subtitle": null,
    "authorCredit": null,
    "body": "I stand before the Galactic Judicial Court, my knees threatening to buckle. A gavel slams, and I feel the echo ripple through my body. As I take my seat, my lawyer rushes to go over our plan.\n\nI feel splinters prick my skin where the wooden chair touches my thighs. The purple short-sleeve jumpsuit I have been forced into leaves my legs and arms mostly bare, and I notice goosebumps from the air conditioning. The gavel slams once more, and I look up. The five judges sitting before me have their lips curled up and daggers in their eyes. The heat of their gaze makes my blood go cold, and I fight the urge to break my eye contact with them.\n\nThe judge in the center has a green tint to his skin with horns protruding from his head. His red eyes bore into my hazel ones. Two other judges sit on both sides of him. On the left, there is a woman with silver eyes and an elderly looking man with purple lips. On the right, there are two women who look identical to each other, both with pale white skin and deep blue eyes. I'm the one who must look like an alien to them.\n\nThe judge in the center's voice booms. \"Felicity Jones of the planet Earth, you have been charged with first-degree murder of the Galactic Representative of Aegyptus. How do you plead?\"\n\nI take a sharp breath, my heart speeding up. I cast a sideways glance to my lawyer, and I meet his gentle neon green eyes. He gives me a small nod.\n\n\"Your honor, I plead not guilty.\" My voice cracks but I hold my head up. The judge's red eyes darken until I find myself staring into the exact shade of blood.\n\n\"Then the court will invite Mr. Zuhell to present the evidence against the defendant.\"\n\nA short translucent man steps onto the dais. There is a window on the ceiling, and his horns catch light from a nearby moon.\n\n\"Your honors, this matter has an obvious explanation,\" the prosecutor states, shoving his hands in his pockets. \"Three rotations ago, the Representative of Aegyptus visited Earth on a diplomatic matter. But when our security forces attempted to contact him, they found no response. They tracked his echolocation to a swamp land called Mississippi, where Ms. Jones lives. Once they found the body and retrieved it from the river, the investigators saw a knife plunged in his heart,\" he holds up a glass bubble which contains my grandfather's hunting knife.\n\n\"They sent it to Galactic Forensic Analysis, who identified Ms. Jones' fingerprints on the weapon. It is clear what happened. Earthling Felicity Jones murdered the kind Representative of Aegyptus. There is no other possible explanation. Thank you.\" My cheeks heat as I watch the prosecutor step down from the dais and walk back to his seat. He meets my eyes and gives me a sneer.\n\n\"Thank you, Mr. Zuhell. This evidence is very enlightening. Would the defendant's counsel like to respond?\" The judge in the center raises his eyebrows at me, his face filled with glee at the prospect of embarrassing me further. I look over at Mr. Folins as he gathers himself together. He takes short breaths, the rise and fall of his chest seeming to be the only noise in the court. I watch as he gets up and walks to the dais.\n\n\"I am Carlile Folins and I represent Ms. Felicity Jones. There is one simple piece of evidence that the prosecutor has not acknowledged. Ms. Jones has not been in the state of Mississippi for the last month. She has been working at a veterinary clinic in Louisiana. In fact, they have records of Ms. Jones being at the office on the day of the murder. Unless this mortal can be in two places at once, she cannot be guilty of this crime.\" He hands over a stack of papers from Morgan City Clinic, the vet I work at. The female judge with silver hair and eyes takes them from Mr. Folins, briefly flipping through the pages. She passes it down until it reaches the judge in the center, whose jaw clenches.\n\n\"Is this all the evidence you have?\" he questions. Mr. Folins glances back at me before nodding.\n\n\"Very well. You may sit.\" He dismisses Mr. Folins, who looks defeated, with a flick of his hand.\n\nThe judge in the center glances at the others. \"I believe this case needs no further discussion,\" he says. The other judges nod.\n\n\"Due to a clear lack of evidence, this court charges Felicity Jones with a count of first degree murder. This is to be expected, of course. Ms. Jones is just as arrogant as the rest of her kind.\" As he speaks, his razor sharp teeth flash.\n\n\"What does this have to do with me being human?\" My voice shakes as I glare at him.\n\n\"Everything. Take her away.\" Seven syllables, four words, and two sentences. That is all it took for my entire life to disappear. Guards seize me in every direction, and I am pushed forward before I stumble down the aisle. My mind is whirling, my hands are shaking, and tears are threatening to fall down my face as I walk towards the end.\n\n\"How could it be her?\" My lawyer pleads. \"She wasn't even in the state where the murder happened. You're making a mistake!\" His words are muffled by the crowd's cheers.\n\nRight before I reach the doors, a flash of brown catches the corners of my eyes. Brown hair? Here? Where everyone has silver hair or purple skin? I force my neck from one of the guard's grasp to angle my head towards the girl. She sits in the crowd, tracking my every movement. Dull hazel eyes, pale skin, shoulder length brown hair, and a mole below her left eye. My eyes widen as all the air rushes from my body. I'm staring at myself.",
    "excerpt": "I stand before the Galactic Judicial Court, my knees threatening to buckle. A gavel slams, and I feel the echo ripple through my body..."
  },
  {
    "id": 9,
    "title": "They Said the Sky Was Blue",
    "category": "Prose",
    "tags": ["dystopia", "sight", "blindness", "freedom"],
    "date": "2026-02-24",
    "submittedTo": null,
    "subtitle": null,
    "authorCredit": null,
    "body": "He opened his eyes for the first time at twenty past three pm. The world arrived at his front door step in ruptures. Light. Shape. Pain.\n\nThen focus. He blinked.\n\nGray's breath came out quick and laboured. Goosebumps broke out, hairs stood up, and his skin tingled. The sterile walls of the hospital went in and out of focus. Gray could see the white paint, but he also noticed the texture of the walls. Uneven. Bumpy. Rough. He imagined what it would feel like to touch it now that he knew what it looked like. The fluorescent lights above him flickered and hummed. Gray moved his sore neck up and stared. He understood what bright meant now. Not just the concept of brightness. The feeling of it. Brightness was biting. It went through his eyes and scratched his skull.\n\nHe blinked, slower this time. Dr. Jordan's outline resolved into angular flesh- sharp collar bones, sunken cheeks, iris implants that seemed to shine like blue batteries. He didn't smile.\n\n\"You can see\", he stated.\n\n\"I can see.\"\n\n\"You'll adapt to the sudden overload. In time,\" he added, moving his hands in gestures to articulate his point. Gray's eyes focused on them. The hands that had given Gray sight. They looked cold.\n\nWhen the doctors cleared him to leave the hospital after hours of examinations and observations, Gray stepped outside alone. The sky was not blue as he had been told in primary school. It was bruises of colors: dark and light shades of gray tinged with smoke. The city was a broken jawline of towers, each one leaning like they wanted to fall but were not given permission. Huge screens blinked on the side of a few of the buildings. Gray desperately wanted to know what was written on them. The letters were large and bold.\n\nA smell like hot metal and blood swelled up from the cracks of the concrete, demanding Gray's attention. He kept walking.\n\nTwo blocks down, a boy screamed. Gray turned his head to look.\nThe boy was on fire.\nNot metaphorically.\nNot symbolically.\nHe was burning. Skin searing, breath choking, and no one helping. People watched, out of horror, but no one called an ambulance. No one said a word. They just silently recorded the scene and watched with frozen eyes.\nA buzzing sound rushed above Gray's head, and he looked up to see a drone. It broadcasted, \"Citizen 318- Sentence Executed.\" Execution was sanctioned. The onlookers were not allowed to save the punished, even if innocents were killed for not wearing the country flag's colors.\n\nGray kept walking. He ventured block after block, witnessing countless executions, but no one intervened to help. The people were drifting around him like ghosts- witnesses with no will. It was the government's orders.\n\nGray saw two women holding signs and shouting words.\n\"Return our bodies,\" they sobbed, a tune that made Gray' ears want to split. Our bodies hadn't been taken literally, but our choices, our control, our autonomy had been stolen. The women were clubbed to the ground before they could say another chant.\nHe kept walking. His vision trembled with static, a side effect the doctors had warned him about. Before his sight, back in the dark, the world had still been cruel- but it hadn't been everywhere. Blindness had given him a kindness: ignorance. Gray had only heard soft whispers and sweet mumblings from the nurses who had taken care of him all his life. He only heard softness from words. Now? Everything had shape, form. Everything was sharp.\n\nGray had wanted sight to see colors, that pretty blue, to understand beauty- to join the world he had only listened to. But his gift came with prickly thorns. Now he thought even hope had teeth. He kept walking.\n\nHe saw a small girl carrying a cracked doll. The child's skin was pale, her eyes hollow. The doll's head had a crack going from its forehead to mouth. The girl's eyes drifted down and stopped on a sign placed just above Gray's heart. Gray couldn't read what it said.\n\n\"Why did you get the surgery?\" she wondered.\n\n\"To see,\" Gray whispered, looking around in fear of the guards.\n\nHer brows furrowed and scrunched. \"To see what?\"\n\nThat night, Gray went through the door of his single unit apartment. It didn't creek. It clicked. It shut behind Gray like an instruction as he walked into the apartment. It was smaller than it used to feel. Gray had imagined color- rich walls, worn cushions, maybe something orange. Orange had always sounded warm to him. But now, all he could see were scales of black. White walls that aren't really white, more the color of old gauze or expired milk. Everything seemed to have been rinsed of color, hung up, and left to dry.\n\nHe sat on a stool in his kitchen-if it could even be called that. It was a straight line of silence. One pan, one cup, one blunt knife. Nothing sharp - government regulation. No colors or smells. Just metal and cold.\n\nThe mirror from the hospital sat in his lap. He stared into it. He couldn't recognize himself.\n\nHe reached behind his ear, feeling for the tactile panel he knew hid there. Every patient was given one- a backup switch. A failsafe. A mercy is how Gray liked to think of it.\n\n\"Do you wish to revert? Press once for 'No' and press twice for 'yes',\" the automated voice spoke. Gray's fingers hovered, trembling. He pressed once. Twice.\n\nThe world dimmed.\n\nAnd for the first time since having sight, Gray cried. Because in the dark, there was the comfort of not knowing. Because blindness no longer meant innocence.\n\nBecause his imagination now had fuel.",
    "excerpt": "He opened his eyes for the first time at twenty past three pm. The world arrived at his front door step in ruptures. Light. Shape. Pain..."
  }
]
