[
  {
    "id": 1,
    "title": "Sea Life",
    "category": "Poetry",
    "tags": ["nature", "ocean", "body", "surreal"],
    "date": "2026-01-15",
    "submittedTo": "Foyle Young Poets",
    "subtitle": null,
    "authorCredit": null,
    "body": "Sweltering sunlight burns my eyelids \nPopping my green orbs open as smoke clouds my vision\nCurtains crawled, bunched on the floor with \nnecklaces tied so tightly around \nmy neck that I suffocate on my white pillow cases as I roll around\nmy dice and watch as they\nM\nE\nL\nT\nagainst the heat of the sun I watch the light—\nseep in through my blinds and cascade over my \nburnished amber hued silhouette\nI smell deep inside the ocean blue sea and look \nout past the beach, sand curdled up around my toes\nRocks and seashells digging in so tightly as \nSlimed seaweed strangles my angles\nHolding me down into place as the sun\nburns Swiss holes into my skin\ncrabs knead their way into my deep blue veins filled with kraken ink\nI watch as time moves backwards\nUntil I reach the green eyed little girl \nShe throws toys into the sea and blinds\ncurtains float across the water, blocking the great whites\nSuffocating them, draining them of color\nI can feel rays welting my skin\nLife as plants intersect themselves into my eyes sockets\nand fish swim in my hair nest\nGrowing faster and faster against the burning fiery tendrils\nof the melting sweltering sun\nI look up to see eagles soaring around the deep blue sky\nPreying on the weak animals buried deep into my flesh\nMy veins coarse through my plant body as I ground myself into the earth sand\nIn every crevice\nPlants in my mouth, suffocating and strangling my tongue as it fights against the surface of the deep blue water. \n\nI never want this day day day to end until the \nplants die\nthe seaweed falls off\nAnd the crabs crawl out of my bronze body while the sun burns \nit like an oven \nI never want this day to end \neven when the clock's arm tick tick ticks faster\nAnd that same green eyed girl kicks against the surface, \nkilling my crabs,\nSlicing my plants off my \nlifeless \nvineless \ncolorless \nbody as I drown in the water.\nThe sun is baking me and I want to cry. I want to scream.\nuntil my tears become the sea",
    "excerpt": "Sweltering sunlight burns my eyelids. Popping my green orbs open as smoke clouds my vision. Curtains crawled, bunched on the floor with necklaces tied so tightly around my neck..."
  },
  {
    "id": 2,
    "title": "Tonight I Can Write",
    "category": "Poetry",
    "tags": ["memory", "loss", "family"],
    "date": "2026-01-20",
    "submittedTo": null,
    "subtitle": "after Pablo Neruda",
    "authorCredit": null,
    "body": "I do not miss the nights of vanish,\nWhen we would laugh until our stomachs sloshed and spun and tumbled onto the floor\n\nI do not miss the anguish scribbled on my mother's face with sloppy pens as the front door turned\nI do not miss the tarnish of our bond, rope hairs snapping\nNor do I miss the broken clock tick deep from my fathers throat\n\nI do not miss the nights of vanish,\nWhen I suffocated from the love eloping me,\nCradling carrying me into my room, tucking me in.\n\nHow can I miss the nights of vanish?\nWhere he kissed my cheek and looped our bonds again,\nSecuring the square knot\n\nI cannot miss the nights of vanish,\nWhen the sun spun no stilling in sight\nWhen vanish meant disappearing not a trick.\n\nUs holding hands 8 kilometers apart\n\nVanish, anguish, and tarnish all from those nights\n\nBut most of all, I miss the nights of vanish\n\nWhen he soared high into the sky\nUp into the endless seas of chances\n\nDipping down into the shallow water and spraying me as I watched in \nAwe",
    "excerpt": "I do not miss the nights of vanish, when we would laugh until our stomachs sloshed and spun and tumbled onto the floor..."
  },
  {
    "id": 3,
    "title": "John Doe",
    "category": "Poetry",
    "tags": ["dreams", "identity", "stranger"],
    "date": "2026-02-01",
    "submittedTo": null,
    "subtitle": null,
    "authorCredit": null,
    "body": "I've seen him in my dreams \nAnd nightmares holding a flashlight onto my thoughts\nBefore His clothes faded out into the background of my room\nI've seen him on the street holding a sign with black marker\nLaying out on the floor with a beanie\nI've seen him when he handed me my hot chocolate\nThe scorching cup that made me hiss not fazing him\nI've seen him open the heavy glass door for me and my mom\nTelling me to have a good day,\nWhen he would entire my mind that night\nIronic, right?\nI've seen him outside, in a store, holding a door\nIn my dreams blinding my eyes\nBut I still don't know who this man is.\nDo you?",
    "excerpt": "I've seen him in my dreams and nightmares holding a flashlight onto my thoughts. Before His clothes faded out into the background of my room..."
  },
  {
    "id": 4,
    "title": "Anselm Kiefer: The Renowned Orders of the Night",
    "category": "Poetry",
    "tags": ["art", "ekphrasis", "night", "stars"],
    "date": "2026-02-05",
    "submittedTo": null,
    "subtitle": null,
    "authorCredit": null,
    "body": "Stars flooding the sky\nLike heat flames centered in the earth\nWith cracks on the floor, dry dry dry\nBoy in the middle, lying down up\nAnd against the stars\nGiven up\n\nThey are flooding him, he is their prisoner\nTaken from his bed in the middle of the night\nAnd sacrificed onto dry stones\nAnd bright lights\nLying down against the\nStunning, blinding lights\n\nHe can't move, can't sweat, can't breathe\nHow could he? \nWhen the stars are in his throat,\nAnd light is seeping from out his chest into the air\n\nExploding around him in whooshes \n\nHe utterly belongs to the night\nDead in its wake\nRising in its light\nBut he still can't move?\nHow could he?\nWhen he's bare and so vulnerable\nSo fragile against the all mighty night\nAnd when the wind brushes the stars to the side\nAnd sunlight rises in their wake\nHe will get up and leave,\n\nWait for the next night\nTo give himself up for the\nBright stars.",
    "excerpt": "Stars flooding the sky like heat flames centered in the earth. With cracks on the floor, dry dry dry. Boy in the middle, lying down up and against the stars..."
  },
  {
    "id": 5,
    "title": "4 White Horse Men",
    "category": "Poetry",
    "tags": ["surreal", "dark", "animals"],
    "date": "2026-02-10",
    "submittedTo": null,
    "subtitle": null,
    "authorCredit": null,
    "body": "4 white horse men\nprancing in a dark room necks out long\nhanging loosely by their dragging feet\ntongues lolling licking lips\n\neyes in walls\neyes etched into the surface\neyes' gaze following the horses \ntrotting about the room\nlips sore now\neyes like diamonds\n\nleft right left right\nsoft delicate hands evil man\nforgiving water tempting power\n\nhorses? they're sheep\neyes covered hands hooves jutted out tails wagging\n\nsoftly singing lullaby noises humming happy tunes\nwalking into invisible water\n\ndying of thirst",
    "excerpt": "4 white horse men prancing in a dark room necks out long, hanging loosely by their dragging feet, tongues lolling licking lips..."
  },
  {
    "id": 6,
    "title": "Dying of Thirst",
    "category": "Poetry",
    "tags": ["fire", "shame", "villanelle"],
    "date": "2026-02-15",
    "submittedTo": null,
    "subtitle": null,
    "authorCredit": null,
    "body": "Blazing heat twirling a ballet\nCurling at the ends like wisps of hair kissed by moonlight \nDowncast eyes keeping me away \n\nFlickering inwards hugging itself in a golden embrace \nOn toes that tremble with cracks of might \nBlazing heat twirling a ballet \n\nCrumplets of ash fanning across cheeks\nPirouettes of fire dancing to the melody of the night \nDowncast eyes keeping me away \n\nA pulse that flares red then fades to gray\nShame biting in cold sort of way\nBlazing heat twirling a ballet \n\nSmoke floats on the verge of dismay\nCrying loud against the sway of inferno\nDowncast eyes keeping me away \n\nVanishing before the flames can stay\nSparks retreat in a haunting pyre\nBlazing heat twirling a ballet\nDowncast eyes keeping me away ",
    "excerpt": "Blazing heat twirling a ballet. Curling at the ends like wisps of hair kissed by moonlight. Downcast eyes keeping me away..."
  },
  {
    "id": 7,
    "title": "The Only Subject We're Proud to Be Bad At",
    "category": "Opinion",
    "tags": ["education", "mathematics", "gender", "STEM"],
    "date": "2026-02-20",
    "submittedTo": null,
    "subtitle": null,
    "authorCredit": "By Isabella Zapparoli",
    "body": "The most effective form of disempowerment isn't censorship, but confusion. \n\n\"I'm not a math person.\" \"Math isn't for me.\" These statements sound harmless, though they mean something profound: society has mistaken ignorance for identity. Behind these phrases lies a system that has taught us to fear being wrong, to associate numbers with humiliation, and to believe that math belongs to certain types of people. These statements are almost said with pride, but no one would ever boast, \"I can't read.\" Illiteracy in words would be catastrophic for a student, but illiteracy in numbers is seen as a whimsical personality trait.\n\nIf math isn't for you, then who is it for? The chosen elites? The mythical \"geniuses\" who are born calculating the digits of π? This is the narrative of our society: that math belongs to the gifted, not the ordinary. But myths like these have grave consequences. They make us smaller than we are. And this myth has facilitated the creation of a world of people fluent in opinions but illiterate in numbers, a world that fears being wrong more than ignorance. \n\nThe real problem isn't the subject itself; it's how we've been taught to fear failure. School and academic institutions have turned mathematics into a performance scale, not a progress of learning. Students have become accustomed to not raising their hands, dreading going to math class, and fearing the embarrassment of not being able to solve a math problem. The result of this is a generation that would rather abandon the subject altogether than risk failure.\n\nThis fear has manifested itself miles beyond the classroom. In an age of algorithms, data, and misinformation, people who believe \"math isn't for them\" are easier to manipulate. Statistics and graphs become forms of sorcery we nod at as proof of our intelligence, even when we don't understand them. Numbers can be twisted without any resistance because most people don't have enough confidence to question or push back. Numerical illiteracy isn't just an academic failure — it's a civic one.\n\nAnd gendered expectations have made this worse. Girls, in particular, are subtly — and sometimes not so subtly — steered away from mathematics. Teachers call on boys more often in math class. Parents are more likely to tell their daughters that it's okay not to be a math person. The result? Girls internalize the idea that math isn't for them before they've even given it a real chance. And the cycle continues: fewer women in STEM fields, fewer female engineers and data scientists, fewer women in positions where numerical literacy gives you power.\n\nSo what do we do? We stop treating mathematical ignorance as charming or acceptable. We stop letting people off the hook with \"I'm just not a math person.\" We reframe failure in mathematics not as a sign of inadequacy, but as a necessary step in learning. We teach students that confusion is not the opposite of intelligence — it is the beginning of it.\n\nThe world will not wait for us to be comfortable with numbers. Every policy decision, every financial choice, every news headline involving statistics demands a population that can think numerically. The alternative — a society that outsources its critical thinking to whoever presents the most confident-sounding graph — is one that is easily led astray.\n\nWe can do better. We have to.",
    "excerpt": "The most effective form of disempowerment isn't censorship, but confusion. \"I'm not a math person.\" \"Math isn't for me.\" These statements sound harmless, though they mean something profound..."
  },
  {
    "id": 8,
    "title": "Convicted",
    "category": "Prose",
    "tags": ["sci-fi", "courtroom", "identity", "space"],
    "date": "2026-02-22",
    "submittedTo": null,
    "subtitle": null,
    "authorCredit": null,
    "body": "I stand before the Galactic Judicial Court, my knees threatening to buckle. A gavel slams, and I feel the echo ripple through my body. As I take my seat, my lawyer rushes to go over our plan.\n\nI feel splinters prick my skin where the wooden chair touches my thighs. The purple short-sleeve jumpsuit I have been forced into leaves my legs and arms mostly bare, and I notice goosebumps from the air conditioning. The gavel slams once more, and I look up. The five judges sitting before me have their lips curled up and daggers in their eyes. The heat of their gaze makes my blood go cold, and I fight the urge to break my eye contact with them.\n\nThe judge in the center has a green tint to his skin with horns protruding from his head. His red eyes bore into my hazel ones. Two other judges sit on both sides of him. On the left, there is a woman with silver eyes and an elderly looking man with purple lips. On the right, there are two women who look identical to each other, both with pale white skin and deep blue eyes. I'm the one who must look like an alien to them.\n\nThe judge in the center's voice booms. \"Felicity Jones of the planet Earth, you have been charged with first-degree murder of the Galactic Representative of Aegyptus. How do you plead?\"\n\nI take a sharp breath, my heart speeding up. I cast a sideways glance to my lawyer, and I meet his gentle neon green eyes. He gives me a small nod.\n\n\"Your honor, I plead not guilty.\" My voice cracks but I hold my head up. The judge's red eyes darken until I find myself staring into the exact shade of blood.\n\n\"Then the court will invite Mr. Zuhell to present the evidence against the defendant.\"\n\nA short translucent man steps onto the dais. There is a window on the ceiling, and his horns catch light from a nearby moon.\n\n\"Your honors, this matter has an obvious explanation,\" the prosecutor states, shoving his hands in his pockets. \"Three rotations ago, the Representative of Aegyptus visited Earth on a diplomatic mission. He was found dead in his quarters the following morning. The only other person in the building was Felicity Jones, a human diplomat's assistant. The evidence is straightforward: motive, opportunity, and the murder weapon bearing her fingerprints.\"\n\nI clench my jaw. The weapon was a ceremonial dagger I had never seen before in my life.\n\nMy lawyer, Solen, rises. His silver suit catches the dim courtroom light. \"Your honors, the defense will demonstrate that Miss Jones was framed. The fingerprints were obtained through deception, the motive is fabricated, and the true killer remains in this very room.\"\n\nMurmurs ripple through the gallery. I don't dare turn around to look.\n\nThe trial drags on for what feels like several rotations. Witnesses are called. Holograms of the crime scene float above the center of the courtroom. I watch my own face — projected twenty times larger than life — on the evidence screens, looking guilty in still images that strip all context from the moments they capture.\n\nThen Solen calls his witness. A small figure in a gray cloak shuffles to the stand.\n\n\"State your name and occupation,\" Solen says.\n\n\"Mira. I work in the building's atmospheric systems.\"\n\n\"And what did you observe on the night of the Representative's death?\"\n\nMira's voice is barely above a whisper. \"I saw someone enter the Representative's quarters. It was not her.\" She points at me. \"It was the prosecutor.\"\n\nThe courtroom erupts. The gavel slams three times. I turn to look at Mr. Zuhell. His translucent face has gone completely white.",
    "excerpt": "I stand before the Galactic Judicial Court, my knees threatening to buckle. A gavel slams, and I feel the echo ripple through my body..."
  },
  {
    "id": 9,
    "title": "They Said the Sky Was Blue",
    "category": "Prose",
    "tags": ["dystopia", "sight", "blindness", "freedom"],
    "date": "2026-02-24",
    "submittedTo": null,
    "subtitle": null,
    "authorCredit": null,
    "body": "He opened his eyes for the first time at twenty past three pm. The world arrived at his front door step in ruptures. Light. Shape. Pain.\n\nThen focus. He blinked.\n\nGray's breath came out quick and laboured. Goosebumps broke out, hairs stood up, and his skin tingled. The sterile walls of the hospital went in and out of focus. Gray could see the white paint, but he also noticed the texture of the walls. Uneven. Bumpy. Rough. He imagined what it would feel like to touch it now that he knew what it looked like. The fluorescent lights above him flickered and hummed. Gray moved his sore neck up and stared. He understood what bright meant now. Not just the concept of brightness. The feeling of it. Brightness was biting. It went through his eyes and scratched his skull.\n\nHe blinked, slower this time. Dr. Jordan's outline resolved into angular flesh- sharp collar bones, sunken cheeks, iris implants that seemed to shine like blue batteries. He didn't smile.\n\n\"You can see\", he stated.\n\n\"I can see.\"\n\n\"You'll adapt to the sudden overload. In time,\" he added, moving his hands in gestures to articulate his point. Gray's eyes focused on them. The hands that had given Gray sight. They looked cold.\n\nWhen the doctors cleared him to leave the hospital after hours of examinations and observations, Gray stepped outside alone. The sky was not blue as he had been told in primary school. It was bruises of colors: dark and light shades of gray tinged with smoke. The city was a broken jawline of towers, each one leaning like they wanted to fall but were not given permission. Huge screens blinked on the side of a few of the buildings. Gray desperately wanted to know what was written on them. The letters were large and bold.\n\nA smell like hot metal and blood swelled up from the cracks of the concrete, demanding Gray's attention. He kept walking.\n\nTwo blocks down, a boy screamed. Gray turned his head to look.\nThe boy was on fire.\nNot metaphorically.\nNot symbolically.\nActually on fire.\n\nNo one around him moved. Gray watched, frozen, as the boy burned. People passed by with their heads down, eyes fixed on the cracked pavement. A woman in a yellow coat walked directly past him without breaking her stride. The boy's screams faded. Then stopped.\n\nGray's stomach lurched. He forced himself to keep moving.\n\nAt the end of the block, he found a bench and sat down heavily. His new eyes ached. He pressed his palms against them and breathed.\n\nA girl sat down beside him. She had close-cropped hair and a scar running from her left ear to her chin.\n\n\"First day out?\" she asked.\n\n\"That obvious?\"\n\n\"You looked at the boy.\"\n\nGray lowered his hands. \"Someone had to.\"\n\n\"No,\" she said quietly. \"They really didn't. That's the point.\"\n\nShe stood up, adjusted the strap of her bag, and glanced at him sideways.\n\n\"They told you the sky was blue?\"\n\n\"In school. Yes.\"\n\nShe looked up. Gray followed her gaze to the heavy gray ceiling of smog above them.\n\n\"It was,\" she said. \"Once.\"\n\nShe walked away. Gray sat alone on the bench and looked at the world he had been given sight to see. He wasn't sure it was a gift.",
    "excerpt": "He opened his eyes for the first time at twenty past three pm. The world arrived at his front door step in ruptures. Light. Shape. Pain..."
  }
]
